/*------------------------------------------------------------------*/
/********************************************************************/
//         リティ's  ライブラリぃだにょ～
/********************************************************************/
/*------------------------------------------------------------------*/
#pragma warning(disable: 4786)

#define VC_EXTRALEAN		// Windows ヘッダーから殆ど使用されないスタッフを除外します。
#include <windows.h>
#include <windowsx.h>
/********************************************************************/
//規格の違いを吸収する.
/********************************************************************/
#include <.\Comm\rti_comm.h>
#include <.\Comm\rti_GDI.h>
#include <.\Comm\rti_DirectX.h>

/********************************************************************/
//グラフィックスライブラリ
/********************************************************************/
#include <.\Graphics\rti_graphics.h>    //グラフィックスのボス
#include <.\Graphics\rti_bitmaplib.h>   //ビットマップキャラクター制作および破棄
#include <.\Graphics\rti_backsurface.h> //裏画面作成
#include <.\Graphics\rti_fontuse.h>       //RTI_Spグラフィックモードでフォントを使う場合
#include <.\Graphics\rti_anime_ex.h>         //アニメーション
#include <.\Graphics\rti_avi.h>           //AVI PLAY


/********************************************************************/
//グラフィックエフェクト ++
/********************************************************************/
#include <.\Graphics\Effect\rti_wave_effect.h>    //揺らす
#include <.\Graphics\Effect\rti_barst_effect.h>   //爆発
#include <.\Graphics\Effect\rti_waterfall_effect.h>  //滝
#include <.\Graphics\Effect\rti_crash_effect.h>      //揺らす
#include <.\Graphics\Effect\rti_fall_tile_effect.h>  //くずす
#include <.\Graphics\Effect\rti_blined_effect.h>     //ブライント
#include <.\Graphics\Effect\rti_slow_effect.h>       //ゆっくり絵画
#include <.\Graphics\Effect\rti_scroll_effect.h>     //スクロール
#include <.\Graphics\Effect\rti_flowt.h>             //漂う
#include <.\Graphics\Effect\rti_power_effect.h>      //パワーチェンジ
#include <.\Graphics\Effect\rti_feade_effect.h>      //フェード
#include <.\Graphics\Effect\rti_lay_effect.h>        //光線

/********************************************************************/
//グラフィック 3D
/********************************************************************/
#include <./Lim3D/rti_Lim3DMaster.h>

/********************************************************************/
//VCL
/********************************************************************/
#include <.\VCL\rti_vcl_apprication.h> //VCL の基本
#include <.\VCL\rti_vcl_form.h>        //フォーム
#include <.\VCL\rti_vcl_button.h>      //ボタン
#include <.\VCL\rti_vcl_grid.h>        //グリッド
#include <.\VCL\rti_vcl_progress.h>    //プログレスバー
#include <.\VCL\rti_vcl_status.h>      //ステータスバー
#include <.\VCL\rti_vcl_list.h>        //リストボックス
#include <.\VCL\rti_vcl_checkbotton.h> //チェックボックス
#include <.\VCL\rti_vcl_radiobutton.h> //ラジオボタン
#include <.\VCL\rti_vcl_groupbox.h>    //ラジオグループ
#include <.\VCL\rti_vcl_radiobox.h>    //ラジオボタン
#include <.\VCL\rti_vcl_tabcontrol.h>  //タブコントロール
#include <.\VCL\rti_vcl_edit.h>        //エディト
#include <.\VCL\rti_vcl_scroll.h>      //スクロールバー
#include <.\VCL\rti_vcl_static.h>      //スタティックテキスト
#include <.\VCL\rti_vcl_comb.h>		 //コンボボックス
#include <.\VCL\rti_vcl_checkbox.h>    //チェックボックス
#include <.\VCL\rti_vcl_toolbar.h>     //ツールバー
#include <.\VCL\rti_vcl_menu.h>        //メニュー
#include <.\VCL\rti_vcl_object.h>      //VCLの基本クラス
#include <.\VCL\rti_use_scrollbar.h>    //WS_VSCROLLなどのスクロールバー

/********************************************************************/
//DEBUG
/********************************************************************/
#include <.\Base\rti_debug.h>       //デバッグ関係

/********************************************************************/
//ダイアログ
/********************************************************************/
#include <.\Base\rti_error_message.h> //警告やエラーメッセージなど
#include <.\Base\rti_dialog.h>           //ダイアログボックス

/********************************************************************/
//リージョン
/********************************************************************/
#include <.\Base\rti_rgn.h>           //リュージョン


/*****************************************************************/
//多重起動の防止    アトム版(鉄腕ぢゃないよ(お約束) )
/*****************************************************************/
#include <.\Base\rti_nonDuplication.h>

/********************************************************************/
//計算
/********************************************************************/
#include <.\Base\rti_glookup.h>          //ルックアップテーブル その他

/********************************************************************/
//ジョィスティック
/********************************************************************/
#include <.\Base\rti_joystick.h>         //ジョイスティック 

/********************************************************************/
//音楽
/********************************************************************/
#include <.\Music\rti_music.h>              //MIDI再生
#include <.\Music\rti_cd.h>                 //CD再生
#include <.\Music\rti_wave.h>               //WAVE読み込み
#include <.\Music\rti_wave_player.h>        //WAVE再生

/********************************************************************/
//GDI
/********************************************************************/
#include <.\Graphics\rti_nomal_gdi_bitmap.h> //GDIを使った絵の読み出しとか

/********************************************************************/
//計算
/********************************************************************/
#include <.\Base\rti_glookup.h>

/********************************************************************/
//キー入力
/********************************************************************/
#include <.\Base\rti_key.h>

/********************************************************************/
//時限爆弾
/********************************************************************/
#include <.\Base\rti_time_action.h>

/********************************************************************/
//ゲーム関係
/********************************************************************/
#include <.\Game\rti_Game.h>

/********************************************************************/
//解像度変更
/********************************************************************/
#include <.\Base\rti_ChangeDisplay.h>

/********************************************************************/
//ユーザー定義
/********************************************************************/
//#include <StartLib.h>			  //ユーザ定義のライブラリ

