
#include <.\Base\rti_systeminfo.h>
/*****************************************************************/
/*****************************************************************/
//システム情報の取得!
/*****************************************************************/
/*****************************************************************/

TSystemInfo SystemInfo;

TSystemInfo::TSystemInfo()
{
	//MMX 対応の石か、どうか調べる.
        int a;
        _asm
        {
            mov eax,1
            _emit   0x0f
            _emit   0xa2
            mov a,edx
        }
        if (a & 0x00800000)
            MMX = true;
        else
            MMX = false;
};
