
/*****************************************************************/
//多重起動の防止    アトム版(鉄腕ぢゃないよ(お約束) )
/*****************************************************************/
#include <.\Base\rti_nonDuplication.h>

/*****************************************************************/
//デストラクタ
/*****************************************************************/
TNonDuplication::~TNonDuplication()
{
    if (Atom)
    {   //識別子の削除
        GlobalDeleteAtom(Atom);
    }
}

/*****************************************************************/
//多重起動しているかどうか調べる  している = true
/*****************************************************************/
bool TNonDuplication::IsDuplication(char *SeriStr)
{
    //その識別する文字列があるかどうかチェック.
    if ( GlobalFindAtom(SeriStr) == NULL)
    {   //おや、初めての起動ですね.

        //識別子の登録
        Atom = GlobalAddAtom(SeriStr);
        return false;
    }
    //多重起動しているのらー
    return true;
}
