/**********************************************************/
// リストボックスのイベントとか
/**********************************************************/
#include "StartWithExeFile.h"
#ifdef STATUS_LIFE

#include <.\VCL\rti_vcl_status_event.h>

/**********************************************************/
//コンストラクタ   初期化します...
/**********************************************************/
TStatusEvent::TStatusEvent()
{
}
/**********************************************************/
//WM_COMMAND イベントディスパッチャ
/**********************************************************/
void TStatusEvent::WmCommandCome(WPARAM wParam)
{
	switch(HIWORD(wParam))
	{
	}
}

#endif
