/**********************************************************/
// リストボックスのイベントとか
/**********************************************************/
#include "StartWithExeFile.h"
#ifdef TABCOONTROL_LIFE

#include <.\VCL\rti_vcl_tabcontrol_event.h>

/**********************************************************/
//コンストラクタ   初期化します...
/**********************************************************/
TTabControlObject::TTabControlObject()
{
}
/**********************************************************/
//WM_COMMAND イベントディスパッチャ
/**********************************************************/
void TTabControlObject::WmCommandCome(WPARAM wParam)
{
	switch(HIWORD(wParam))
	{
	}
}

#endif
