/**********************************************************/
// リストボックスのイベントとか
/**********************************************************/
#include "StartWithExeFile.h"
#ifdef STATICTEXT_LIFE

#include <.\VCL\rti_vcl_static_event.h>

/**********************************************************/
//コンストラクタ   初期化します...
/**********************************************************/
TStaticEvent::TStaticEvent()
{
}
/**********************************************************/
//WM_COMMAND イベントディスパッチャ
/**********************************************************/
void TStaticEvent::WmCommandCome(WPARAM wParam)
{
	switch(HIWORD(wParam))
	{
	}
}

#endif
