/**********************************************************/
// リストボックスのイベントとか
/**********************************************************/
#include "StartWithExeFile.h"
#ifdef SCROLLBAR_LIFE

#include <.\VCL\rti_vcl_scroll_event.h>

/**********************************************************/
//コンストラクタ   初期化します...
/**********************************************************/
TScrollEvent::TScrollEvent()
{
}
/**********************************************************/
//WM_COMMAND イベントディスパッチャ
/**********************************************************/
void TScrollEvent::WmCommandCome(WPARAM wParam)
{
	switch(HIWORD(wParam))
	{
	}
}

#endif
